local x = "%1站 (深圳市)"
local ya = "%1站 (地鐵)"
local yb = "%1站 (地铁)"
local yc = "%1 (地铁)"
local za = "%1站 (深圳地鐵)"
local zb = "%1站 (深圳地铁)"
local h = "%1站 (惠州市)"

local p = {
	["system title"] = "[[深圳地铁]]",
	['system color'] = "00A051",
	["line icon format"] = "route",
	["station format"] = {
		"%1站",
		-- 消歧义
		-- 1号线
		["机场东"] = x,
		["后瑞"] = "[[后瑞站|-{后}-瑞]]",--避免转为後
		["西乡"] = x,
		["新安"] = x,
		["大新"] = x,
		["桃园"] = x,
		["車公廟"] = x,
		["会展中心"] = x,
		["大剧院"] = x,
		["老街"] = x,
		["国贸"] = x,
		["罗湖"] = zb,

		-- 2号线
		["后海"] = "[[后海站|-{后}-海]]",--避免转为後
		["福田"] = zb,
		["市民中心"] = x,
		["蓮塘"] = x,

		-- 3号线
		["福保"] = x,
		["益田"] = x,
		["翠竹"] = x,
		["塘坑"] = x,
		["橫崗"] = za,
		["雙龍"] = x,
		["梨园"] = x,
		["新生"] = x,
		["富坪"] = x,

		-- 4号线
		["竹村"] = x,
		["清湖"] = yb,
		["龙华"] = x,
		["深圳北站"] = yc,
		["紅山"] = x,
		["民樂"] = x,

		-- 5号线
		["前湾公园"] = x,
		["临海"] = x,
		["西麗"] = ya,
		["大学城"] = x,
		["坂田"] = zb,
		["杨美"] = x,
		["东门"] = x,		

		-- 6号线
		["体育中心"] = x,
		["银湖"] = x,
		["凤凰城"] = x,
		["光明"] = x,
		["科学公园"] = x,

		-- 6号线支线
		["中大"] = x,
		["光明城"] = yb,

		-- 7号线
		["龙井"] = x,
		["皇岗口岸"] = zb,
		["笋岗"] = yb,

		-- 8号线
		["海山"] = x,

		-- 9号线
		["下沙"] = x,
		["梅村"] = x,

		-- 10号线
		["木古"] = yb,
		["华南城"] = x,
		["平湖"] = ya,
		["龙平路"] = x, --未定

		-- 11号线
		["沙井"] = x,
		["桥头"] = x,
		["机场北"] = x,
		["机场"] = x,
		["南山"] = x,

		-- 12号线
		["沙浦"] = x,
		["福海西"] = yb,
		["怀德"] = x,
		["黄田"] = x,
		["上川"] = x,
		["南头"] = x,
		["中山公园"] = x,
		["宝安客运站"] = yc,

		-- 13号线
		["歌剧院"] = x,
		["松坪"] = x,
		["西丽高铁站"] = yc,
		["石鼓"] = x,
		["新庄"] = x,

		-- 14号线
		["新桥"] = h, --未定
		["惠州南"] = yb, --未定
		["开城"] = h, --未定
		["白云"] = h, --未定
		["沙田"] = x,
		["锦龙"] = x,
		["罗湖北"] = yb,

		-- 15号线
		["海城"] = x,

		-- 16号线
		["大安"] = x,
		["龙东"] = x,
		["龙兴"] = x,
		["新和"] = x,
		["江岭"] = x,
		["石井"] = x,
		["田心"] = x,
		["龙城公园"] = x,
		["技术大学"] = x,
		
		-- 17号线
		["德兴"] = x,
		["南岭"] = x,
		["新南"] = x,
		
		-- 19号线
		["新围"] = x,
		["聚龙"] = x,
		
		-- 20号线
		["国展"] = x,

		-- 25号线
		["石龙"] = x,
		
		-- 32号线
		["上洞"] = x,
		["葵涌"] = x,
		
		-- 模板格式需要
		['2号线赤湾'] = "[[梧桐山南站|梧桐山南]]<br>[[深圳地铁2号线|2号线]][[赤湾站 (深圳地铁)|赤湾]]",
		['8号线溪涌'] = "[[蓮塘站 (深圳市)|蓮塘]]<br>[[深圳地铁8号线|8号线]][[溪涌站|溪涌]]",
		['外圈'] = "外圈",
		['内圈'] = "内圈",

	},
	["lines"] = {
		["_default"] = {
			["title"] = "[[深圳地铁%1号线|%1号线]]",
			["icon"] = "[[File:ShenzhenMetroLine%1.svg|x18px|link=深圳地铁%1号线]]",
			["color"] = "bbbbbb",
			['text color'] = "FFFFFF",
		},
		["1"] = {
			["color"] = "00ab39",
			["left terminus"] = "机场东",
			["right terminus"] = "罗湖"
		},
		["2"] = {
			["color"] = "db6d1c",
			["left terminus"] = "赤湾",
			["right terminus"] = "8号线溪涌",
			["types"] = {
				["L"] = {
					["title"] = "",
					["right terminus"] = "蓮塘",
				},
			    ["8"] = {
					["title"] = "",
					["right terminus"] = "溪涌",
				},
			},
		},
		["3"] = {
			["color"] = "00a2e1",
			["left terminus"] = "福保",
			["right terminus"] = "坪地六联",
		},
		["4"] = {
			["color"] = "dc241f",
			["left terminus"] = "牛湖",
			["right terminus"] = "福田口岸"
		},
		["5"] = {
			["color"] = "9950b2",
			["left terminus"] = "大剧院",
			["right terminus"] = "赤湾",
		},
		["6"] = {
			["color"] = "3abca8",
			["left terminus"] = "松岗",
			["right terminus"] = "科学馆",
		},
		["6支"] = {
			["title"] = "[[深圳地铁6号线支线|6号线支线]]",
			["icon"] = "",
			["color"] = "037776",
			["left terminus"] = "深理工",
			["right terminus"] = "光明城",
			["types"] = {
				["F"] = {
					["title"] = "未来发展",
					["left terminus"] = "黄江南",
				},
			},
		},
		["7"] = {
			["color"] = "0035ad",
			["left terminus"] = "深大丽湖",
			["right terminus"] = "太安",
			["types"] = {
				["B"] = {
					["title"] = "支线",
					["left terminus"] = "深云",
					["right terminus"] = "文体公园",
				},
			},
		},
		["8"] = {
			["color"] = "db6d1c",
			["left terminus"] = "2号线赤湾",
			["right terminus"] = "溪涌",
			["types"] = {
				["L"] = {
					["title"] = "",
					["left terminus"] = "蓮塘",
				},
				["2"] = {
					["title"] = "",
					["left terminus"] = "赤湾",
				},
			},
		},
		["9"] = {
			["color"] = "846e74",
			["left terminus"] = "前湾",
			["right terminus"] = "文锦"
		},
		["10"] = {
			["color"] = "f8779e",
			["left terminus"] = "福田口岸",
			["right terminus"] = "双拥街"
		},
		["11"] = {
			["color"] = "6a1d44",
			["left terminus"] = "碧头",
			["right terminus"] = "红岭南",
		},
		["12"] = {
			["color"] = "a192b2",
			["left terminus"] = "松岗",
			["right terminus"] = "左炮台东",
			["types"] = {
			},
		},
		["13"] = {
			["color"] = "de7c00",
			["left terminus"] = "深圳湾口岸",
			["right terminus"] = "李松蓢",
			["types"] = {
				["F"] = {
					["title"] = "建设中",
					["left terminus"] = "东角头",
				}
			}
		},
		["14"] = {
			["color"] = "f2c75c",
			['text color'] = "000000",
			["left terminus"] = "岗厦北",
			["right terminus"] = "沙田"
		},
		["15"] = {
			["color"] = "76b900",
			["circular"] = true,
			["left terminus"] = "内环",
			["right terminus"] = "外环"
		},
		["16"] = {
			["color"] = "1e22aa",
			["left terminus"] = "园山西坑",
			["right terminus"] = "田心",
		},
		["17"] = {
			["icon"] = "",
			["color"] = "c6afd4",
			["left terminus"] = "侨社",
			["right terminus"] = "上李朗"
		},
		["18"] = {
			["icon"] = "",
			["color"] = "034ea2",
			["left terminus"] = "沙井",
			["right terminus"] = "盐田路"
		},
		["19"] = {
			["icon"] = "",
			["color"] = "bb16a3",
			["left terminus"] = "南塘围",
			["right terminus"] = "聚龙"
		},
		["20"] = {
			["color"] = "88dbdf",
			['text color'] = "000000",
			["left terminus"] = "机场北",
			["right terminus"] = "会展城",
			["types"] = {
				["F"] = {
					["title"] = "建设中",
					["left terminus"] = "白石洲",
				},
		},
		},
		["22"] = {
			["icon"] = "",
			["color"] = "fbe122",
			["left terminus"] = "上沙",
			["right terminus"] = "黎光"
		},
		["24"] = {
			["icon"] = "",
			["color"] = "79ABDE",
			["left terminus"] = "小南山西",
			["right terminus"] = "东湖公园"
		},
		["25"] = {
			["icon"] = "",
			["color"] = "fead77",
			["left terminus"] = "石龙",
			["right terminus"] = "吉华医院"
		},
		["27"] = {
			["icon"] = "",
			["color"] = "3c8065",
			["left terminus"] = "松坪村",
			["right terminus"] = "杨美"
		},
		["29"] = {
			["icon"] = "",
			["color"] = "9f2f47",
			["left terminus"] = "兴东",
			["right terminus"] = "红树湾南"
		},
		["32"] = {
			["icon"] = "",
			["color"] = "ba5801",
			["left terminus"] = "溪涌",
			["right terminus"] = "葵涌东"
		},
		--城市名前缀及非编号路线全称
		["深1"] = {
			["title"] = "[[深圳地铁1号线|深圳1号线]]",
			["color"] = "00ab39",
		},
		["深2"] = {
			["title"] = "[[深圳地铁2号线|深圳2号线]]",
			["color"] = "db6d1c",
		},
		["深3"] = {
			["title"] = "[[深圳地铁3号线|深圳3号线]]",
			["color"] = "00a2e1",
		},
		["深4"] = {
			["title"] = "[[深圳地铁4号线|深圳4号线]]",
			["color"] = "dc241f",
		},
		["深5"] = {
			["title"] = "[[深圳地铁5号线|深圳5号线]]",
			["color"] = "9950b2",
		},
		["深6"] = {
			["title"] = "[[深圳地铁6号线|深圳6号线]]",
			["color"] = "3abca8",
		},
		["深6支"] = {
			["title"] = "[[深圳地铁6号线支线|深圳6号线支线]]",
			["color"] = "037776",
		},
		["深7"] = {
			["title"] = "[[深圳地铁7号线|深圳7号线]]",
			["color"] = "0035ad",
		},
		["深11"] = {
			["title"] = "[[深圳地铁11号线|深圳11号线]]",
			["color"] = "6a1d44",
		},
		["深12"] = {
			["title"] = "[[深圳地铁12号线|深圳12号线]]",
			["color"] = "a192b2",
		},
		["深13"] = {
			["title"] = "[[深圳地铁13号线|深圳13号线]]",
			["color"] = "de7c00",
		},		
		["深20"] = {
			["title"] = "[[深圳地铁20号线|深圳20号线]]",
			["color"] = "88dbdf",
			['text color'] = "000000",
		},
	},
	["aliases"] = {
		--6号线支线转换
		["34"] = "6支",
		["6b"] = "6支",
		["6B"] = "6支",
		["深6b"] = "深6支",
		["深6B"] = "深6支",
	}
}
local stationAliases = {
		-- 同站名转换
		-- 1号线
		["機場東"] = '机场东',
		["西鄉"] = '西乡',
		["前海湾"] = '前海灣',
		["鲤鱼门"] = '鯉魚門',
		["桃園"] = '桃园',
		["华侨城"] = '華僑城',
		["侨城东"] = '僑城東',
		["车公庙"] = '車公廟',
		["购物公园"] = '購物公園',
		["會展中心"] = '会展中心',
		["岗厦"] = '崗廈',
		["华强路"] = '華強路',
		["科学馆"] = '科學館',
		["大劇院"] = '大剧院',
		["國貿"] = '国贸',
		["羅湖"] = '罗湖',

		-- 2号线
		["後海"] = '后海',
		["湖贝"] = '湖貝',
		["莲塘口岸"] = '蓮塘口岸',
		["莲塘"] = '蓮塘',

		-- 3号线
		["少年宫"] = '少年宮',
		["红岭"] = '紅嶺',
		["晒布"] = '曬布',
		["木棉湾"] = '木棉灣',
		["丹竹头"] = '丹竹頭',
		["六约"] = '六約',
		["横岗"] = '橫崗',
		["大运"] = '大運',
		["爱联"] = '愛聯',
		["龙城广场"] = '龍城廣場',
		["南联"] = '南聯',
		["双龙"] = '雙龍',

		-- 4号线
		["观澜湖"] = '觀瀾湖',
		["松元厦"] = '松元廈',
		["观澜"] = '觀瀾',
		["长湖"] = '長湖',
		["龙胜"] = '龍勝',
		["红山"] = '紅山',
		["白石龙"] = '白石龍',
		["民乐"] = '民樂',
		["莲花北"] = '蓮花北',
	
		-- 5号线
		["臨海"] = '临海',
		["西丽"] = '西麗',
		["长岭陂"] = '長嶺陂',
		["上水径"] = '上水徑',

		-- 7号线
		["皇崗口岸"] = '皇岗口岸',
		["筍崗"] = '笋岗',
	
		-- 9号线
		["梦海"] = '夢海',
		["南山书城"] = '南山書城',
		["粤海门"] = '粵海門',
		["红树湾南"] = '紅樹灣南',
		["孖岭"] = '孖嶺',

		-- 10号线
		["双拥街"] = '雙擁街',
	
		-- 11号线
		["機場北"] = '机场北',
		["機場"] = '机场',
		["碧海湾"] = '碧海灣',

		-- 12号线
		["國展"] = '国展',
	
		-- 13号线
		["西麗高鐵站"] = '西丽高铁站',
	
}
for k, v in pairs(stationAliases) do
	if p["station format"][v] == nil then
		p["station format"][k] = '[[' .. v .. '站|' .. v .. ']]'
	else
		p["station format"][k] = p["station format"][v]
	end
end
return p