local p = {
	["system title"] = "[[广州地铁]]",
	["system icon"] = "[[File:Guangzhou Metro icon.svg|x16px|text-bottom|link=广州地铁]]",
	["lines"] = {
		["_default"] = {
			["title"] = "[[广州地铁%1号线|%1号线]]",
			["icon"] = "[[File:GZM Line %1 icon.svg|x20px|link=广州地铁%1号线]]",
			["color"] = "bbbbbb",
			['text color'] = "FFFFFF",
		},
		["1"] = {
			["title"] = "[[广州地铁1号线|1号线]]",
			["disamb short name"] = "G1", -- experimental
			["color"] = "edcf3b",
			['text color'] = "000000",
			["left terminus"] = "西塱",
			["right terminus"] = "广州东站"
		},
		["2"] = {
			["title"] = "[[广州地铁2号线|2号线]]",
			["color"] = "00679e",
			["left terminus"] = "广州南站",
			["right terminus"] = "嘉禾望岗"
		},
		["3"] = {
			["title"] = "[[广州地铁3号线|3号线]]",
			["color"] = "e89e47",
			["left terminus"] = "海傍",
			["right terminus"] = {"机场北", "天河客运站"},
			['types'] = {
				['主'] = {
					["title"] = "主线",
					["right terminus"] = "机场北"
				}, -- 3支拆解后删除即可，可回落至主线
				['支'] = {
					["title"] = "支线",
					["right terminus"] = "天河客运站"
				}, -- 3支拆解后删除即可，可回落至主线
				['北'] = {
					["title"] = "北延段",
					["left terminus"] = "体育西路",
					["right terminus"] = "机场北"
				}, -- 3支拆解后删除即可，可回落至主线
				['F'] = {
					["title"] = "",
					["note-mid"] = "未来发展",
					["right terminus"] = "机场北"
				}
			}
		},
		["4"] = {
			["title"] = "[[广州地铁4号线|4号线]]",
			["color"] = "01824a",
			["left terminus"] = "黄村",
			["right terminus"] = "南沙客运港"
		},
		["5"] = {
			["title"] = "[[广州地铁5号线|5号线]]",
			["color"] = "c70541",
			["left terminus"] = "滘口",
			["right terminus"] = "黄埔新港"
		},
		["6"] = {
			["title"] = "[[广州地铁6号线|6号线]]",
			["color"] = "6e0346",
			["left terminus"] = "浔峰岗",
			["right terminus"] = "香雪"
		},
		["7"] = {
			["title"] = "[[广州地铁7号线|7号线]]",
			["color"] = "9dd32d",
			["left terminus"] = "美的大道",
			["right terminus"] = "燕山"
		},
		["8"] = {
			["title"] = "[[广州地铁8号线|8号线]]",
			["color"] = "00858a",
			["left terminus"] = "滘心",
			["right terminus"] = "万胜围",
			['types'] = {
				['F'] = {
					["title"] = "",
					["note-mid"] = "未来发展",
					["left terminus"] = "江府",
					["right terminus"] = "莲花"
				}
			}
		},
		["9"] = {
			["title"] = "[[广州地铁9号线|9号线]]",
			["color"] = "5ec998",
			['text color'] = "000000",
			["left terminus"] = "飞鹅岭",
			["right terminus"] = "高增"
		},
		["10"] = {
			["title"] = "[[广州地铁10号线|10号线]]",
			["color"] = "6e90b6",
			["left terminus"] = "西塱",
			["right terminus"] = "杨箕东",
			['types'] = {
				['F'] = {
					["title"] = "",
					["note-mid"] = "未来发展",
					["right terminus"] = "天河客运站"
				}
			}
		},
		["11"] = {
			["title"] = "[[广州地铁11号线|11号线]]",
			["color"] = "F5BB17",
			['text color'] = "000000",
			["circular"] = true,
			["left terminus"] = "外环",
			["right terminus"] = "内环"
		},
		["12"] = {
			["title"] = "[[广州地铁12号线|12号线]]",
			["color"] = "59621d",
            ["note-mid"] = "西段",
			["left terminus"] = "浔峰岗",
			["right terminus"] = "广州体育馆",
			['types'] = {
				['E'] = {
					["title"] = "",
					["note-mid"] = "东段",
					["left terminus"] = "二沙岛",
					["right terminus"] = "大学城南"
				},
				['F'] = {
					["title"] = "",
					["note-mid"] = "未来发展",
					["left terminus"] = "浔峰岗",
					["right terminus"] = "大学城南"
				}
			}
		},
		["13"] = {
			["title"] = "[[广州地铁13号线|13号线]]",
			["color"] = "888600",
			["left terminus"] = "天河公园",
			["right terminus"] = "新沙",
			['types'] = {
				['F'] = {
					["title"] = "",
					["note-mid"] = "未来发展",
					["left terminus"] = "鸦岗"
				}
			}
		},
		["14"] = {
			["title"] = "[[广州地铁14号线|14号线]]",
			["color"] = "792720",
			["left terminus"] = "乐嘉路",
			["right terminus"] = "东风",
			['types'] = {
				['Z'] = {
					["title"] = "",
					["note-mid"] = "知识城支线",
					["left terminus"] = "新和",
					["right terminus"] = "镇龙"
				},
				['F'] = {
					["title"] = "",
					["note-mid"] = "未来发展",
					["right terminus"] = "广州火车站"
				}
			}
		},
		["14z"] = {
			["title"] = "[[广州地铁14号线|14号线]]",
			["note-mid"] = "知识城支线",
			["icon"] = "[[File:GZM Line 14 icon.svg|x20px|link=广州地铁14号线]]",
			["color"] = "792720",
			["left terminus"] = "新和",
			["right terminus"] = "镇龙"
		},
		["15"] = {
			["title"] = "[[广州地铁15号线|15号线]]",
			["icon"] = "[[File:Guangzhou Metro icon.svg|x16px|link=广州地铁15号线]]",
			["color"] = "ae8a79"-- 未开通，标志色仅供参考
		},
		["16"] = {
			["title"] = "[[广州地铁16号线|16号线]]",
			["icon"] = "[[File:Guangzhou Metro icon.svg|x16px|link=广州地铁16号线]]",
			["color"] = "9e652e"-- 未开通，标志色仅供参考
		},
		["17"] = {
			["title"] = "[[广州地铁17号线|17号线]]",
			["icon"] = "[[File:Guangzhou Metro icon.svg|x16px|link=广州地铁17号线]]",
			["color"] = "8b84d7"-- 未开通，标志色仅供参考
		},
		["18"] = {
			["title"] = "[[广州地铁18号线|18号线]]",
			["color"] = "364c9c",
			["left terminus"] = "冼村",
			["right terminus"] = "万顷沙",
			['types'] = {
				['F'] = {
					["title"] = "",
					["note-mid"] = "未来发展",
					["left terminus"] = "花城街",
					["right terminus"] = "兴中"
				}
			}
		},
		["19"] = {
			["title"] = "[[广州地铁19号线|19号线]]",
			["icon"] = "[[File:Guangzhou Metro icon.svg|x16px|link=广州地铁19号线]]",
			["color"] = "bb29bb"-- 未开通，标志色仅供参考
		},
		["20"] = {
			["title"] = "[[广州地铁20号线|20号线]]",
			["icon"] = "[[File:Guangzhou Metro icon.svg|x16px|link=广州地铁20号线]]",
			["color"] = "d9017a"-- 未开通，标志色仅供参考
		},
		["21"] = {
			["title"] = "[[广州地铁21号线|21号线]]",
			["color"] = "230b55",
			["left terminus"] = "天河公园",
			["right terminus"] = "增城广场",
		},
		["22"] = {
			["title"] = "[[广州地铁22号线|22号线]]",
			["color"] = "d14d23",
			["left terminus"] = "芳村",
			["right terminus"] = "番禺广场",
			['types'] = {
				['F'] = {
					["title"] = "",
					["note-mid"] = "未来发展",
					["left terminus"] = "机场北"
				}
			}
		},
		["24"] = {
			["title"] = "[[广州地铁24号线|24号线]]",
			["icon"] = "[[File:Guangzhou Metro icon.svg|x16px|link=广州地铁24号线]]",
			["color"] = "1fada9",-- 未开通，标志色仅供参考
			["left terminus"] = "广州北站",
			["right terminus"] = "纪念堂"
		},
		["28"] = {
			["title"] = "[[广州地铁28号线|28号线]]",
			["icon"] = "[[File:Guangzhou Metro icon.svg|x16px|link=广州地铁28号线]]",
			["color"] = "d28bb7",-- 未开通，标志色仅供参考
			["left terminus"] = "鹭洲",
			["right terminus"] = "新塘",
			['types'] = {
				['F'] = {
					["title"] = "",
					["note-mid"] = "未来发展",
					["right terminus"] = "松山湖"
				}
			}
		},
		["广佛"] = {
			["title"] = "[[广佛地铁|广佛线]]",
			["disamb short name"] = "GF", -- experimental
			["icon"] = "[[File:GZM Guangfo Line icon.svg|x20px|link=广佛地铁]]",
			["color"] = "bbd80a",
			['text color'] = "000000",
			["left terminus"] = "新城东",
			["right terminus"] = "沥滘",
		},
		["APM"] = {
			["title"] = "[[珠江新城旅客自动输送系统|APM线]]",
			["icon"] = "[[File:GZM APM LINE.svg|x20px|link=珠江新城旅客自动输送系统]]",
			["color"] = "00bde2",
			["left terminus"] = "广州塔",
			["right terminus"] = "林和西"
		},
		["THZ1"] = {
			["title"] = "[[广州海珠有轨电车1号线|海珠有轨1号线]]",
			["icon"] = "[[File:Guangzhou Metro icon.svg|x16px|link=广州海珠有轨电车1号线]]",
			["color"] = "5eb630",
			["left terminus"] = "广州塔T2",
			["right terminus"] = "万胜围T"
		},
		["THP1"] = {
			["title"] = "[[广州黄埔有轨电车1号线|黄埔有轨1号线]]",
			["icon"] = "[[File:Guangzhou Metro icon.svg|x16px|link=广州黄埔有轨电车1号线]]",
			["color"] = "bd0000",
			["left terminus"] = "地铁香雪",
			["right terminus"] = "新丰路",
		},
		["THP2"] = {
			["title"] = "[[广州黄埔有轨电车2号线|黄埔有轨2号线]]",
			["icon"] = "[[File:Guangzhou Metro icon.svg|x16px|link=广州黄埔有轨电车2号线]]",
			["color"] = "e4007f",
			["left terminus"] = "地铁香雪",
			["right terminus"] = "开源大道东",
			['types'] = {
				['F'] = {
					["title"] = "",
					["note-mid"] = "未来发展",
					["right terminus"] = "地铁南岗"
				}
			}
		},
		--城市名前缀及非编号路线全称
		["G1"] = {
			["title"] = "[[广州地铁1号线|广州1号线]]",
			["color"] = "edcf3b",
			['text color'] = "000000",
		},
		["G2"] = {
			["title"] = "[[广州地铁2号线|广州2号线]]",
			["color"] = "00679e",
		},
		["G3"] = {
			["title"] = "[[广州地铁3号线|广州3号线]]",
			["color"] = "e89e47",
		},
		["G4"] = {
			["title"] = "[[广州地铁4号线|广州4号线]]",
			["color"] = "01824a",
		},
		["G5"] = {
			["title"] = "[[广州地铁5号线|广州5号线]]",
			["color"] = "c70541",
		},
		["G6"] = {
			["title"] = "[[广州地铁6号线|广州6号线]]",
			["color"] = "6e0346",
		},
		["G7"] = {
			["title"] = "[[广州地铁7号线|广州7号线]]",
			["color"] = "9dd32d",
		},
		["G8"] = {
			["title"] = "[[广州地铁8号线|广州8号线]]",
			["color"] = "00858a",
		},
		["G9"] = {
			["title"] = "[[广州地铁9号线|广州9号线]]",
			["color"] = "5ec998",
			['text color'] = "000000",
		},
		["G10"] = {
			["title"] = "[[广州地铁10号线|广州10号线]]",
			["color"] = "6e90b6",
		},
		["G11"] = {
			["title"] = "[[广州地铁11号线|广州11号线]]",
			["color"] = "F5BB17",
			['text color'] = "000000",
		},
		["G12"] = {
			["title"] = "[[广州地铁12号线|广州12号线]]",
			["color"] = "59621d",
		},
		["G13"] = {
			["title"] = "[[广州地铁13号线|广州13号线]]",
			["color"] = "888600",
		},
		["G14"] = {
			["title"] = "[[广州地铁14号线|广州14号线]]",
			["color"] = "792720",
		},
		["G18"] = {
			["title"] = "[[广州地铁18号线|广州18号线]]",
			["color"] = "364c9c",
		},
		["G21"] = {
			["title"] = "[[广州地铁21号线|广州21号线]]",
			["color"] = "230b55",
		},
		["G22"] = {
			["title"] = "[[广州地铁22号线|广州22号线]]",
			["color"] = "d14d23",
		},
		["G24"] = {
			["title"] = "[[广州地铁24号线|广州24号线]]",
			["color"] = "1fada9",-- 未开通，标志色仅供参考
		},
		["G28"] = {
			["title"] = "[[广州地铁28号线|广州28号线]]",
			["color"] = "d28bb7",-- 未开通，标志色仅供参考
		},
		["GF-L"] = {
			["title"] = "[[广佛地铁]]",
			["color"] = "bbd80a",
		},
		["APM-L"] = {
			["title"] = "[[珠江新城旅客自动输送系统]]",
			["color"] = "00bde2",
		},
		["THZ1-L"] = {
			["title"] = "[[广州海珠有轨电车1号线|海珠有轨电车1号线]]",
			["color"] = "5eb630",
		},
		["THP1-L"] = {
			["title"] = "[[广州黄埔有轨电车1号线|黄埔有轨电车1号线]]",
			["color"] = "bd0000",
		},
		["THP2-L"] = {
			["title"] = "[[广州黄埔有轨电车2号线|黄埔有轨电车2号线]]",
			["color"] = "e4007f",
		},
	},
	["aliases"] = {
		["g"] = "广佛",
		["gf"] = "广佛",
		["guangfo"] = "广佛",
		["a"] = "APM",
		["apm"] = "APM",
		["k"] = "14z",
		["kc"] = "14z",
		["27"] = "14z",
		["thz1"] = "THZ1",
		['黄埔1'] = 'THP1',
		['thp1'] = 'THP1',
		['黄埔2'] = 'THP2',
		['thp2'] = 'THP2',
		['f'] = 'F',
		['主线'] = '主',
		['支线'] = '支',
		['z'] = 'Z',
	},
	["station format"] = {
		"%1站",
		-- 消歧义
		-- 1号线
		["广州东站"] = "[[广州东站 (地铁)|广州东站]]",
		["体育中心"] = "[[体育中心站 (广州地铁)|体育中心]]",
		["烈士陵园"] = "[[烈士陵园站 (广州市)|烈士陵园]]",
		["西门口"] = "[[西门口站 (广州市)|西门口]]",
		["长寿路"] = "[[长寿路站 (广州市)|长寿路]]",
		["芳村"] = "[[芳村站 (广州市)|芳村]]",
		["坑口"] = "[[坑口站 (广州市)|坑口]]",

		-- 2号线
		["广州火车站"] = "[[广州火车站 (地铁)|广州火车站]]",
		["南浦"] = "[[南浦站 (广州市)|南浦]]",
		["广州南站"] = "[[广州南站 (地铁)|广州南站]]",

		-- 3号线
		["机场北"] = "[[机场北站 (广州市)|机场北]]",
		["机场南"] = "[[机场南站 (广州市)|机场南]]",
		["人和"] = "[[人和站 (广州市)|人和]]",
		["永泰"] = "[[永泰站 (广州市)|永泰]]",
		["天河客运站"] = "[[天河客运站 (地铁)|天河客运站]]",
		["广州塔"] = "[[广州塔站 (地铁)|广州塔]]",
		["大塘"] = "[[大塘站 (广州市)|大塘]]",
		["大石"] = "[[大石站 (广州市)|大石]]",

		-- 4号线
		["黄村"] = "[[黄村站 (广州市)|黄村]]",
		["万胜围"] = "[[万胜围站 (地铁)|万胜围]]",
		["大学城北"] = "[[大学城北站 (广州市)|大学城北]]",
		["大学城南"] = "[[大学城南站 (广州市)|大学城南]]",
		["官桥"] = "[[官桥站 (广州市)|官桥]]",
		["东涌"] = "[[东涌站 (广州市)|东涌]]",
		["庆盛"] = "[[庆盛站 (地铁)|庆盛]]",
		["塘坑"] = "[[塘坑站 (广州市)|塘坑]]",

		-- 5号线
		["西场"] = "[[西场站 (广州市)|西场]]",
		["西村"] = "[[西村站 (广州市)|西村]]",
		["小北"] = "[[小北站 (广州市)|小北]]",
		["动物园"] = "[[动物园站 (广州市)|动物园]]",
		["科韵路"] = "[[科韵路站 (地铁)|科韵路]]",
		["庙头"] = "[[庙头站 (广州市)|庙头]]",

		-- 6号线
		["文化公园"] = "[[文化公园站 (广州市)|文化公园]]",
		["北京路"] = "[[北京路站 (广州市)|北京路]]",
		["东湖"] = "[[东湖站 (广州市)|东湖]]",
		["沙河"] = "[[沙河站 (广州市)|沙河]]",
		["植物园"] = "[[植物园站 (广州市)|植物园]]",
		["龙洞"] = "[[龙洞站 (广州地铁)|龙洞]]",
		["黄陂"] = "[[黄陂站 (广州市)|黄陂]]",
		["香雪"] = "[[香雪站 (广州地铁)|香雪]]",

		-- 7号线
		["锦龙"] = "[[锦龙站 (佛山市)|锦龙]]",
		["陈村"] = "[[陈村站 (地铁)|陈村]]",
		["大洲"] = "[[大洲站 (广州市)|大洲]]",
		["板桥"] = "[[板桥站 (广州市)|板桥]]",
		["深井"] = "[[深井站 (广州地铁)|深井]]",
		["长洲"] = "[[长洲站 (广州市)|长洲]]",
		["水西"] = "[[水西站 (广州地铁)|水西]]",
		["燕山"] = "[[燕山站 (广州市)|燕山]]",

		-- 8号线
		["江村"] = "[[江村站 (地铁)|江村]]",
		["江高"] = "[[江高站 (地铁)|江高]]",
		["石井"] = "[[石井站 (广州市)|石井]]",
		["聚龙"] = "[[聚龙站 (广州市)|聚龙]]",
		["沙园"] = "[[沙园站 (广州市)|沙园]]",
		["中大"] = "[[中大站 (广州市)|中大]]",
		["琶洲"] = "[[琶洲站 (地铁)|琶洲]]",
		["新洲"] = "[[新洲站 (广州市)|新洲]]",
		["化龙"] = "[[化龙站 (广州市)|化龙]]",
		["莲花"] = "[[莲花站 (广州市)|莲花]]",

		-- 9号线
		["广州北站"] = "[[广州北站 (地铁)|广州北站]]",
		["莲塘"] = "[[莲塘站 (广州市)|莲塘]]",
		["清塘"] = "[[清塘站 (广州市)|清塘]]",
		
		-- 10号线
		["大干围"] = "[[大干围站|-{zh:大干围;zh-hans:大干围;zh-hant:大幹圍;}-]]",-- 简繁转换
		["天河路"] = "[[天河路站 (广州市)|天河路]]",
		
		-- 11号线
		["石围塘"] = "[[石围塘站 (地铁)|石围塘]]",
		["大冲口"] = "[[大冲口站|大沖口]]", -- 避免转为衝
		["燕岗"] = "[[燕岗站 (广州市)|燕岗]]",
		["龙潭"] = "[[龙潭站 (广州市)|龙潭]]",
		["中医药大学"] = "[[中医药大学站 (广州市)|中医药大学]]",
		["龙口西"] = "[[龙口西站 (广州市)|龙口西]]",
		
		-- 12号线
		["广州白云站"] = "[[广州白云站 (地铁)|广州白云站]]",
		["景泰"] = "[[景泰站 (广州市)|景泰]]",
		["麓湖"] = "[[麓湖站 (广州市)|麓湖]]",
		["北山"] = "[[北山站 (广州市)|北山]]",

		-- 13号线
		["庆丰"] = "[[庆丰站 (广州市)|庆丰]]",
		["棠下"] = "[[棠下站 (广州市)|棠下]]",
		["南岗"] = "[[南岗站 (广州地铁)|南岗]]",
		["沙村"] = "[[沙村站 (广州市)|沙村]]",
		["新塘"] = "[[新塘站 (广州地铁)|新塘]]",
		["新沙"] = "[[新沙站 (广州市)|新沙]]",

		-- 14号线
		["太和"] = "[[太和站 (广州市)|太和]]",
		["竹料"] = "[[竹料站 (地铁)|竹料]]",
		["新和"] = "[[新和站 (广州地铁)|新和]]",
		["太平"] = "[[太平站 (广州市)|太平]]",
		["从化客运站"] = "[[从化客运站 (地铁)|从化客运站]]",
		["东风"] = "[[东风站 (广州市)|东风]]",
		["红卫"] = "[[红卫站 (广州市)|红卫]]",
		--["新南"] = "[[新南站 (广州市)|新南]]",
		["枫下"] = "[[枫下站 (广州市)|枫下]]",
		["镇龙"] = "[[镇龙站 (地铁)|镇龙]]",

		-- 16号线
		["新塘客运站"] = "[[新塘客运站 (地铁)|新塘客运站]]",
		["沙浦"] = "[[沙浦站 (地铁)|沙浦]]",
		["石滩"] = "[[石滩站 (地铁)|石滩]]",
		["增城火车站"] = "[[增城火车站 (地铁)|增城火车站]]",
		["少年宫"] = "[[少年宫站 (广州市)|少年宫]]",
		["仙村"] = "[[仙村站 (地铁)|仙村]]",
		
		-- 18号线
		["横沥"] = "[[横沥站 (广州市)|横沥]]",
		["万顷沙"] = "[[万顷沙站 (地铁)|万顷沙]]",
		["香山"] = "[[香山站 (中山市)|香山]]",
		['火炬'] = '[[火炬站 (中山市)|火炬]]',
		['中山站'] = '[[中山站 (地铁)|中山站]]',
		['客运港'] = '[[客运港站 (中山市)|客运港]]',		
		['珠海北站'] = '[[珠海北站 (地铁)|珠海北站]]',
		['拱北'] = '[[广州地铁18号线#南延段|拱北]]', -- 避免直链至珠海站

		-- 21号线
		["科学城"] = "[[科学城站 (广州市)|科学城]]",
		["长平"] = "[[长平站 (广州地铁)|长平]]",
		["金坑"] = "[[金坑站 (广州市)|金坑]]",
		["山田"] = "[[山田站 (广州市)|山田]]",
		
		-- 22号线
		["机场东"] = "[[机场东站 (广州市)|机场东]]",
		
		-- 24号线
		["桃源"] = "[[桃源站 (广州市)|桃源]]",
		["黄石"] = "[[黄石站 (广州市)|黄石]]",
		
		-- 28号线
		["佛山西站"] = "[[佛山西站 (地铁)|佛山西站]]",
		["沙堤"] = "[[沙堤站 (佛山)|沙堤]]",
		["奇槎"] = "[[奇槎站 (地铁)|奇槎]]",
		["三眼桥"] = "[[三眼桥站 (地铁)|三眼桥]]",
		["艺洲路"] = "[[赤岗塔站#28号线|艺洲路]]",
		["黄埔站"] = "[[黄埔站 (地铁)|黄埔站]]",
		["市民中心"] = "[[市民中心站 (东莞市)|市民中心]]",
		["寮步"] = "[[寮步站 (地铁)|寮步]]",

		-- 广佛线
		["石溪"] = "[[石溪站 (广州市)|石溪]]",
		["鹤洞"] = "[[鹤洞站 (广州市)|鹤洞]]",
		["龙溪"] = "[[龙溪站 (广州市)|龙溪]]",
		["东平"] = "[[东平站 (佛山市)|东平]]",

		-- APM线
		["体育中心南"] = "[[体育中心南站 (广州市)|体育中心南]]",
		["大剧院"] = "[[大剧院站 (广州市)|大剧院]]",

		-- THZ1
		["广州塔T1"] = "[[广州塔站 (有轨电车废站)|广州塔（旧）]]",
		["广州塔T2"] = "[[广州塔站 (有轨电车)|广州塔]]",
		["万胜围T"] = "[[万胜围站 (有轨电车)|万胜围]]",

		-- THP1
		["地铁香雪"] = "[[地铁香雪站 (黄埔有轨电车)|地铁香雪]]",
		["市民广场"] = "[[市民广场站 (广州市)|市民广场]]",
		["会议中心"] = "[[会议中心站 (广州市)|会议中心]]",
		["地铁水西"] = "[[地铁水西站 (黄埔有轨电车)|地铁水西]]",
		["水西T"] = "[[水西站 (黄埔有轨电车)|水西]]",
		["地铁长平"] = "[[地铁长平站 (黄埔有轨电车)|地铁长平]]",
		["岭头"] = "[[岭头站 (广州市)|岭头]]",
		
		-- THP2
		["刘村"] = "[[刘村站 (有轨)|刘村]]",
		["地铁南岗"] = "[[地铁南岗站 (黄埔有轨电车)|地铁南岗]]",
	}
}
local stationAliases = {
	-- 同站名转换
	-- 1号线
	['廣州東站'] = '广州东站',
	['广州东'] = '广州东站',
	['體育中心'] = '体育中心',

	-- 2号线
	["嘉禾望崗"] = "嘉禾望岗",
	["萧岗"] = "蕭崗",
	["廣州火車站"] = "广州火车站",
	["广州"] = "广州火车站",
	["会江"] = "會江",
	["广州南"] = "广州南站",

	-- 3号线
	["機場北"] = "机场北",
	["天河客運站"] = "天河客运站",
   	["天河客运"] = "天河客运站",
	["番禺客运"] = "傍江",
	["番禺客运站"] = "傍江",
	["广州新城西"] = "石碁南",
	["金光大道"] = "海涌路",
	
	-- 4号线
	["车陂"] = "車陂",
	["车陂南"] = "車陂南",
	["萬勝圍"] = "万胜围",
	["黃村"] = "黄村",
	["大學城北"] = "大学城北",
	["大學城南"] = "大学城南",
	["東涌"] = "东涌",

	-- 5号线
	["大沙东"] = "大沙東",
	["文冲"] = "文沖",
	["庙头路"] = "庙头",
	["广州开发区"] = "夏港",
	["黄埔客运港"] = "黄埔新港",

	-- 6号线
	["浔峰岗"] = "潯峰崗",
	["黃陂"] = "黄陂",
	["萝岗"] = '蘿崗',

	-- 7号线
	['陈村北'] = "陳村北",
	["洪圣沙"] = "洪聖沙",
	["加庄"] = "加莊",
	["水西北"] = "燕山",

	-- 8号线
	["鹅掌坦"] = "鵝掌坦",
	["华林寺"] = "華林寺",
	["草堂"] = "蒙地",

	-- 9号线
	["广州北"] = "广州北站",

	-- 10号线
	["广钢新城"] = "花围",
	["工业大道"] = "工业大道南",
	["中大南门"] = "中大南門",
	["寺右新马路"] = "五羊邨",
	["广州大道中"] = "杨箕东",

	-- 11号线
	["流花路"] = "流花",
	["大沖口"] = "大冲口",
	["芳村大道东"] = "大冲口",
	["南石路"] = "棣园",
	["燕崗"] = "燕岗",
	["上涌公园"] = "上涌",
	["赤沙滘"] = "赤沙",
	["华景路"] = "華景路",
	["天河东"] = "龙口西",
	["大金钟"] = "大金钟路",
	["广园新村"] = "中医药大学",

	-- 12号线
	["里横路"] = "浔峰岗北",
	["槎头"] = "西洲",
	["棠溪"] = "广州白云站",
	["白云站"] = "广州白云站",
	["南航新村"] = "棠涌",
	["齐富路"] = "新市墟",
	["云溪公园"] = "广州体育馆",
	["小金钟"] = "景泰",
	["景云路"] = "柯子岭",
	["恒福路"] = "麓湖",
	["二沙岛"] = '二沙島',
	['广州艺博院'] = '赤岗塔',
	['岭南广场'] = '赤岗塔',
	["赤沙（北）"] = "赤沙北",
	["赤沙12"] = "赤沙北",
	["仑头"] = "北山",

	-- 13号线
	["朝阳"] = "鸦岗",
	["西洲L13"] = "槎龙",
	["松溪"] = "松洲",
	["农林下路"] = "执信",
	["竹丝岗"] = "执信",
	["马场"] = "暨大",	
	["白马岗"] = "员村山顶",		
	["珠村"] = "天河珠村",

	-- 14号线
	["東風"] = "东风",
	["从化客运"] = "从化客运站",
	["紅衛"] = "红卫",
	["鹤南"] = "鹤龙",
	["创意园"] = "鹤边",
	["岗贝"] = "云霄路",

	-- 18号线
	['十二涌'] = '十三涌',
	['张家边'] = '火炬西',
	['中山'] = '中山站',
	['世纪路'] = '岐江新城',

	-- 21号线

	-- 22号线
	["白云"] = "白云站",
	["陈头岗"] = "陳頭崗",

	-- 24号线

	-- 28号线
	["佛山西"] = "佛山西站",
	["鸿福路"] = "市民中心",

	-- 广佛线
	["鶴洞"] = "鹤洞",
	["菊树"] = "菊樹",
	["龍溪"] = '龙溪',
	["金融高新区"] = '金融高新區',
	["千灯湖"] = '千燈湖',
	["𧒽岗"] = '𧒽崗',
	["虫雷岗"] = '𧒽岗',
	["虫雷崗"] = '𧒽岗',
	["祖庙"] = '祖廟',
	["同济路"] = '同濟路',
	["季华园"] = '季華園',
	["佛山东平"] = '东平',
	["新城东"] = '新城東',

	-- APM
	["黄埔大道"] = "黃埔大道",

	-- THZ1
	["廣州塔T"] = '广州塔T1',
	["广州塔T"] = '广州塔T1',
	["广州塔东"] = '广州塔T2',
	["萬勝圍T"] = '万胜围T',

	-- THP1

	-- THP2

}
for k, v in pairs(stationAliases) do
	if p["station format"][v] == nil then
		p["station format"][k] = '[[' .. v .. '站|' .. v .. ']]'
	else
		p["station format"][k] = p["station format"][v]
	end
end
return p